In [1]:
import pandas as pd
import numpy as np
from tqdm import tqdm

In [2]:
# settings
# pd.set_option('display.height', 1000)
# pd.set_option('display.max_rows', 500)
# pd.set_option('display.max_columns', 500)
# pd.set_option('display.width', 1000)

In [3]:
df = pd.read_csv('data/titanic_train.csv')

In [269]:
#df = pd.read_csv('train.csv', nrows=2)

In [4]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [5]:
df.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
474,475,0,3,"Strandberg, Miss. Ida Sofia",female,22.0,0,0,7553,9.8375,NaN,S

In [6]:
df.shape

(891, 12)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [8]:
df.dtypes # http://pbpython.com/pandas_dtypes.html

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [9]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [11]:
print(np.percentile(df.Age.values[~np.isnan(df.Age.values)], 25))
print(np.percentile(df.Age.values[~np.isnan(df.Age.values)], 75))

20.125
38.0

In [12]:
df[df.columns[1:5]].head()

   Survived  Pclass                                               Name     Sex
0         0       3                            Braund, Mr. Owen Harris    male
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2         1       3                             Heikkinen, Miss. Laina  female
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4         0       3                           Allen, Mr. William Henry    male

In [13]:
df[['Name', 'Age', 'Sex', 'Embarked']].sample(2)

                                              Name   Age     Sex Embarked
15                Hewlett, Mrs. (Mary D Kingcome)   55.0  female        S
187  Romaine, Mr. Charles Hallace ("Mr C Rolmane")  45.0    male        S

In [14]:
df.Sex.unique(), df.Sex.nunique()

(array(['male', 'female'], dtype=object), 2)

#### apply

In [15]:
%%time
df['first_name'] = df.apply(lambda row: row['Name'].split(',')[0], axis=1)

CPU times: user 14.5 ms, sys: 0 ns, total: 14.5 ms
Wall time: 15 ms

In [16]:
%%time
df['first_name'] = df['Name'].apply(lambda l: l.split(',')[0])

CPU times: user 0 ns, sys: 3.04 ms, total: 3.04 ms
Wall time: 2.76 ms

In [17]:
tqdm.pandas()

In [18]:
df['first_name'] = df['Name'].progress_apply(lambda l: l.split(',')[0])

100%|██████████| 891/891 [00:00<00:00, 562396.52it/s]

In [19]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen

In [20]:
df.drop(columns=['first_name'], inplace=True)

In [21]:
df_ = df.copy()

In [22]:
df.drop(index=[1], inplace=True)

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [24]:
df.reset_index(inplace=True, drop='index')

In [25]:
df.set_index('PassengerId', inplace=True)

In [26]:
df.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

In [27]:
df_.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [28]:
df_.loc[df_[df_.Age >= 40].index, 'old_or_young'] = 0
df_.loc[df_[df_.Age < 40].index, 'old_or_young'] = 1

In [29]:
df.iloc[1]

Survived                         1
Pclass                           3
Name        Heikkinen, Miss. Laina
Sex                         female
Age                             26
SibSp                            0
Parch                            0
Ticket            STON/O2. 3101282
Fare                         7.925
Cabin                          NaN
Embarked                         S
Name: 3, dtype: object

In [30]:
df.loc[1]

Survived                          0
Pclass                            3
Name        Braund, Mr. Owen Harris
Sex                            male
Age                              22
SibSp                             1
Parch                             0
Ticket                    A/5 21171
Fare                           7.25
Cabin                           NaN
Embarked                          S
Name: 1, dtype: object

In [31]:
df.loc[1].Fare, df.iloc[1].Fare

(7.25, 7.925)

In [32]:
df.loc[1:4]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S

In [33]:
df.iloc[1:4]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

In [ ]:
# При большом датафрейме можно сделать себе копию определенного размера
# df.loc[np.random.choice(df.index, size=10000, replace=False), :]

In [34]:
df_.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,old_or_young
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0

In [35]:
df_.rename(columns={'old_or_young': 'young'}, inplace=True)

In [36]:
df_.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,young
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0

In [37]:
df_ = df_.iloc[1:101]

In [38]:
a = df.Ticket.unique()
b = df_.Ticket.unique()
print(np.setdiff1d(a, b).shape)
print(np.intersect1d(a, b).shape)

(584,)
(96,)

### Merge, concate, join, append
http://pandas.pydata.org/pandas-docs/stable/merging.html#joining-on-index

In [39]:
df = df[['Name', 'Sex', 'Age']].head(5).copy()

In [40]:
df_ = df_[['Name', 'Ticket', 'Age', 'Pclass']].loc[3:7].copy()

In [41]:
df.head()

                                                     Name     Sex   Age
PassengerId
1                                 Braund, Mr. Owen Harris    male  22.0
3                                  Heikkinen, Miss. Laina  female  26.0
4            Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                Allen, Mr. William Henry    male  35.0
6                                        Moran, Mr. James    male   NaN

In [42]:
df_.head()

                                           Name  Ticket   Age  Pclass
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)  113803  35.0       1
4                      Allen, Mr. William Henry  373450  35.0       3
5                              Moran, Mr. James  330877   NaN       3
6                       McCarthy, Mr. Timothy J   17463  54.0       1
7                Palsson, Master. Gosta Leonard  349909   2.0       3

In [43]:
df.append(df_)

/home/boozzee/PycharmProjects/NapoleonMLCourse/vivenv/lib/python3.6/site-packages/pandas/core/frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

    Age                                          Name  Pclass     Sex  Ticket
1  22.0                       Braund, Mr. Owen Harris     NaN    male     NaN
3  26.0                        Heikkinen, Miss. Laina     NaN  female     NaN
4  35.0  Futrelle, Mrs. Jacques Heath (Lily May Peel)     NaN  female     NaN
5  35.0                      Allen, Mr. William Henry     NaN    male     NaN
6   NaN                              Moran, Mr. James     NaN    male     NaN
3  35.0  Futrelle, Mrs. Jacques Heath (Lily May Peel)     1.0     NaN  113803
4  35.0                      Allen, Mr. William Henry     3.0     NaN  373450
5   NaN                              Moran, Mr. James     3.0     NaN  330877
6  54.0                       McCarthy, Mr. Timothy J     1.0     NaN   17463
7   2.0                Palsson, Master. Gosta Leonard     3.0     NaN  349909

In [44]:
df.shape, df_.shape

((5, 3), (5, 4))

In [45]:
df_after_append = df.append(df_, sort=False)

In [46]:
pd.concat([df, df_], sort=False, join='outer') #inner

                                           Name     Sex   Age  Ticket  Pclass
1                       Braund, Mr. Owen Harris    male  22.0     NaN     NaN
3                        Heikkinen, Miss. Laina  female  26.0     NaN     NaN
4  Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0     NaN     NaN
5                      Allen, Mr. William Henry    male  35.0     NaN     NaN
6                              Moran, Mr. James    male   NaN     NaN     NaN
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)     NaN  35.0  113803     1.0
4                      Allen, Mr. William Henry     NaN  35.0  373450     3.0
5                              Moran, Mr. James     NaN   NaN  330877     3.0
6                       McCarthy, Mr. Timothy J     NaN  54.0   17463     1.0
7                Palsson, Master. Gosta Leonard     NaN   2.0  349909     3.0

In [47]:
pd.concat([df, df_], sort=False, join='outer', axis=1) # inner

,Name,Sex,Age,Name,Ticket,Age,Pclass
1,"Braund, Mr. Owen Harris",male,22.0,NaN,NaN,NaN,NaN
3,"Heikkinen, Miss. Laina",female,26.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",113803,35.0,1.0
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,"Allen, Mr. William Henry",373450,35.0,3.0
5,"Allen, Mr. William Henry",male,35.0,"Moran, Mr. James",330877,NaN,3.0
6,"Moran, Mr. James",male,NaN,"McCarthy, Mr. Timothy J",17463,54.0,1.0
7,NaN,NaN,NaN,"Palsson, Master. Gosta Leonard",349909,2.0,3.0

In [48]:
df.reset_index(inplace=True)
df_.reset_index(inplace=True)

In [49]:
pd.merge(df, df_, how='outer', on='Name', suffixes=('_df', '_df_'))

,PassengerId,Name,Sex,Age_df,index,Ticket,Age_df_,Pclass
0,1.0,"Braund, Mr. Owen Harris",male,22.0,NaN,NaN,NaN,NaN
1,3.0,"Heikkinen, Miss. Laina",female,26.0,NaN,NaN,NaN,NaN
2,4.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,3.0,113803,35.0,1.0
3,5.0,"Allen, Mr. William Henry",male,35.0,4.0,373450,35.0,3.0
4,6.0,"Moran, Mr. James",male,NaN,5.0,330877,NaN,3.0
5,NaN,"McCarthy, Mr. Timothy J",NaN,NaN,6.0,17463,54.0,1.0
6,NaN,"Palsson, Master. Gosta Leonard",NaN,NaN,7.0,349909,2.0,3.0

In [50]:
df = pd.read_csv('data/titanic_train.csv')

In [51]:
df.dropna(subset=['Age']).shape[0], df.shape[0]

(714, 891)

In [52]:
df[df.isna().Age].shape, df[df.Age.notna()].shape, df[~df.Age.notna()].shape

((177, 12), (714, 12), (177, 12))

In [53]:
df_ = df.copy()

In [54]:
df_.fillna(df_.mean()['Age'], inplace=True)
df_.Age = df_.Age.astype(int)

In [55]:
df.iloc[4:6]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [56]:
df_.iloc[4:6]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,29.6991,S
5,6,0,3,"Moran, Mr. James",male,29,0,0,330877,8.4583,29.6991,Q

In [57]:
df.set_value(5, 'Age', df[df.Sex == 'male'].Age.mean().round()).loc[5]

/home/boozzee/PycharmProjects/NapoleonMLCourse/vivenv/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                          31
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [58]:
df.at[5, 'Age'] = 13

In [59]:
df.loc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                          13
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [60]:
lst_for_isin = ['F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4']

In [61]:
df[df.Cabin.isin(lst_for_isin)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
128,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
136,137,1,1,"Newsom, Miss. Helen Monypeny",female,19.0,0,2,11752,26.2833,D47,S
139,140,0,1,"Giglio, Mr. Victor",male,24.0,0,0,PC 17593,79.2000,B86,C
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S

In [62]:
%%time
df = df.assign(Gender=df.Sex)

CPU times: user 1.5 ms, sys: 0 ns, total: 1.5 ms
Wall time: 1.09 ms

In [63]:
%%time
df['Gender'] = df['Sex']

CPU times: user 330 µs, sys: 69 µs, total: 399 µs
Wall time: 360 µs

In [64]:
import datetime

dt = datetime.datetime(2010, 12, 1)
end = datetime.datetime(2010, 12, 30, 23, 59, 59)
step = datetime.timedelta(seconds=5)

result = []

while dt < end:
    result.append(dt.strftime('%Y-%m-%d'))
    dt += step

In [65]:
len(result[:891])

891

In [66]:
%%time
df = df.assign(date_born=result[:891])

CPU times: user 2.28 ms, sys: 29 µs, total: 2.31 ms
Wall time: 1.7 ms

In [67]:
%%time
df['date_born'] = result[:891]

CPU times: user 440 µs, sys: 0 ns, total: 440 µs
Wall time: 379 µs

In [68]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Gender,date_born
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,male,2010-12-01
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,female,2010-12-01
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,female,2010-12-01
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,female,2010-12-01
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,male,2010-12-01

In [69]:
df.date_born = pd.to_datetime(df.date_born)

In [70]:
df.dtypes

PassengerId             int64
Survived                int64
Pclass                  int64
Name                   object
Sex                    object
Age                   float64
SibSp                   int64
Parch                   int64
Ticket                 object
Fare                  float64
Cabin                  object
Embarked               object
Gender                 object
date_born      datetime64[ns]
dtype: object

In [71]:
df['Month_born'] = df.date_born.dt.month

In [72]:
df['Day_by_week'] = df.date_born.dt.dayofweek

In [73]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Gender,date_born,Month_born,Day_by_week
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,male,2010-12-01,12,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,female,2010-12-01,12,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,female,2010-12-01,12,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,female,2010-12-01,12,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,male,2010-12-01,12,2

In [81]:
df.groupby('Gender')['Age'].mean()

Gender
female    27.915709
male      30.687599
Name: Age, dtype: float64

In [85]:
pd.DataFrame(df.groupby('Gender')['Age', 'Fare'].mean())

              Age       Fare
Gender
female  27.915709  44.479818
male    30.687599  25.523893

In [74]:
#Пример
df.groupby('something')['datetime'].apply(lambda p: np.sum(
    pd.to_timedelta(np.diff(p)) < pd.Timedelta(minutes=30)))

KeyError: 'something'

In [ ]:
df.to_csv(index=False, sep=';')